**复习：**数据分析的第一步，加载数据我们已经学习完毕了。当数据展现在我们面前的时候，我们所要做的第一步就是认识他，今天我们要学习的就是**了解字段含义以及初步观察数据**。

## 1 第一章：数据载入及初步观察

### 1.4 知道你的数据叫什么
Series:一维数组，值value和索引index
DataFrame:表示的是矩阵的数据表，它是已排列的列集合，每一列可以是不同的值类型。既有行索引也有列索引。

**开始前导入numpy和pandas**

In [25]:
import numpy as np
import pandas as pd

#### 1.4.1 任务一：pandas中有两个数据类型DateFrame和Series，通过查找简单了解他们。然后自己写一个关于这两个数据类型的小例子🌰[开放题]

In [8]:
#Series举例
import numpy as np
import pandas as pd

#Series字典创建
sdata={'math':200,'english':100,'manage':300}
obj1=pd.Series(sdata)
obj1

#查找数学和英语的成绩
obj1[['math','english']]

math       200
english    100
dtype: int64

In [14]:
#DataFrame举例
import numpy as np
import pandas as pd

#创建身高对比
data={'name':['Kang','Kang','Kang','Shi','Shi','Shi'],
     'year':[2004,2005,2006,2004,2005,2006],
     'height':[1.26,1.27,1.33,1.32,1.36,1.42]}
frame=pd.DataFrame(data)
frame

#按照字典形标记或者属性那样检索为Series
frame['height']  #对于任何列名都有效
frame.year   #对于列名是有效py变量时候有效

0    2004
1    2005
2    2006
3    2004
4    2005
5    2006
Name: year, dtype: int64

#### 1.4.2 任务二：根据上节课的方法载入"train.csv"文件

In [15]:
df=pd.read_csv('D:/study/python/data/hands-on-data-analysis-master/第一单元项目集合/train.csv')
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S


#### 1.4.3 任务三：查看DataFrame数据的每列的名称

In [17]:

df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

#### 1.4.4任务四：查看"Cabin"这列的所有值[有多种方法]

In [21]:
df['Cabin'].head(5)

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

In [29]:
df.Cabin.head(3)

#### 1.4.5 任务五：加载文件"test_1.csv"，然后对比"train.csv"，看看有哪些多出的列，然后将多出的列删除
经过我们的观察发现一个测试集test_1.csv有一列是多余的，我们需要将这个多余的列删去

In [24]:
df2=pd.read_csv('D:/study/python/data/hands-on-data-analysis-master/第一单元项目集合/test_1.csv')
df2.columns

Index(['Unnamed: 0', 'PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age',
       'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'a'],
      dtype='object')

In [25]:
#对比发现多了个a列，进行删除
del df2['a']
df2.columns

Index(['Unnamed: 0', 'PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age',
       'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

【思考】还有其他的删除多余的列的方式吗？

In [32]:
# 使用drop进行删除,axis为0时表示删除行，axis为1时表示删除列，还是一样
#errors='raise'会让程序在labels接收到没有的行名或者列名时抛出错误导致程序停止运行，errors='ignore'会忽略没有的行名或者列名，只对存在的行名或者列名进行操作，没有指定的话也是默认‘errors='raise'’
#inplace参数False表示对原数据不生效，Truth表示生效
df2.drop(['Fare'],axis=1,inplace=True)
df2.columns

Index(['Unnamed: 0', 'PassengerId', 'Survived', 'Pclass', 'Name', 'Sex',
       'SibSp', 'Parch', 'Cabin', 'Embarked'],
      dtype='object')

#### 1.4.6 任务六： 将['PassengerId','Name','Age','Ticket']这几个列元素隐藏，只观察其他几个列元素

In [34]:
df2.drop(['PassengerId','Name','Age','Ticket'],axis=1,errors='ignore')
df2.columns

Index(['Unnamed: 0', 'PassengerId', 'Survived', 'Pclass', 'Name', 'Sex',
       'SibSp', 'Parch', 'Cabin', 'Embarked'],
      dtype='object')

【思考回答】

如果想要完全的删除你的数据结构，使用inplace=True，因为使用inplace就将原数据覆盖了，所以这里没有用

在删除了一些索引后，可能会导致原有索引丢失，调取不方便，可以使用reset_index重置索引在获得新的index，原来的index变成数据列，保留在数据框中，不想保留原来的index的话可以使用参数drop=True，默认False。

### 1.5 筛选的逻辑

表格数据中，最重要的一个功能就是要具有可筛选的能力，选出我所需要的信息，丢弃无用的信息。

下面我们还是用实战来学习pandas这个功能。

#### 1.5.1 任务一： 我们以"Age"为筛选条件，显示年龄在10岁以下的乘客信息。

In [46]:
#判断条件，
df['Age']<10

#索引筛选
df[df['Age']<10].head(3)

-------------------------

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a
7,7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.075,NaN,S,100
10,10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.700,G6,S,100
16,16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.125,NaN,Q,100

#### 1.5.2 任务二： 以"Age"为条件，将年龄在10岁以上和50岁以下的乘客信息显示出来，并将这个数据命名为midage

In [48]:
midage=df[(df['Age']>10)&(df['Age']<50)]
midage.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,100
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,100
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,100
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,100
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,100

【提示】了解pandas的条件筛选方式以及如何使用交集和并集操作

#### 1.5.3 任务三：将midage的数据中第100行的"Pclass"和"Sex"的数据显示出来

In [52]:
midage.loc[99,["Pclass","Sex"]]
#这里的99实际上是第100行

Pclass         1
Sex       female
Name: 1, dtype: object

In [51]:
midage.loc[[99],["Pclass","Sex"]]

    Pclass   Sex
99       2  male

【提示】在抽取数据中，我们希望数据的相对顺序保持不变，用什么函数可以达到这个效果呢？

#### 1.5.4 任务四：使用loc方法将midage的数据中第100，105，108行的"Pclass"，"Name"和"Sex"的数据显示出来

In [77]:
###### 写入代码
midage.loc[[99,104,107],["Pclass","Name","Sex"]]

     Pclass                                      Name   Sex
99        2  Navratil, Mr. Michel ("Louis M Hoffman")  male
104       3                           Corn, Mr. Harry  male
107       3                Bengtsson, Mr. John Viktor  male

#### 1.5.5 任务五：使用iloc方法将midage的数据中第100，105，108行的"Pclass"，"Name"和"Sex"的数据显示出来

In [76]:
#写入代码
midage = midage.reset_index(drop=True)
midage.iloc[[99,104,107],[3,4,5]]

     Pclass                                      Name   Sex
99        2  Navratil, Mr. Michel ("Louis M Hoffman")  male
104       3                           Corn, Mr. Harry  male
107       3                Bengtsson, Mr. John Viktor  male

【思考】对比`iloc`和`loc`的异同
1.联系

(1)操作对象相同：loc和iloc都是对DataFrame类型进行操作；

(2)完成目的相同：二者都是用于选取DataFrame中对应行或列中的元素。
2.区别

loc和iloc索引的行列标签类型不同。

iloc使用顺序数字来索引数据，而不能使用字符型的标签来索引数据；注意：这里的顺序数字是指从0开始计数！

loc使用实际设置的索引来索引数据。但行列名为数字时，loc也可以索引数字，但这里的数字不一定从0开始编号，是对应具体行列名的数字！